clear;clc

%% 系统参数
m1 = 1.6; % 电磁吸振器器质量
m2 = 10; % 待减振对象质量
k1 = 34000; % 电磁吸振器刚度
k2 = 100000; % 平台刚度
k_m = 45; % 电—力常数 N/A 来自要求文件
k_E = 30; % 作动器反电动势系数 % 来自图片参数
L = 0.0045; % 线圈的电感 来自图片参数
R_m = 5; % 线圈的电阻 % 来自图片参数
c1 = 0.1; % 电磁吸振器阻尼
c2 = 1; % 平台阻尼
is_a = true; % 是否加速度反馈


%% 状态空间方程建立

A = [0      1       0           0;
    -k1/m1 -c1/m1   k1/m1       c1/m1;
     0      0       0           1;
     k1/m2  c1/m2 -(k1+k2)/m2 -(c1-c2)/m2];
B = [0 k_m/m1 0 1/m2]';
C = [-k1/m1 -c1/m1   k1/m1       c1/m1;
      k1/m2  c1/m2 -(k1+k2)/m2 -(c1-c2)/m2];
D = 0;
E = [0 0 0 c2/m2;
     0 0 0 k2/m2]';
system = ss(A,B,C,D);

num = 1;
den = [L R_m];
G_system = tf(num,den);

%% PID控制器
amp = 0.01; % 振幅
% PID参数
if is_a
    % 加速度反馈
    Kp = 100;    % 比例系数
    Ki = 0;     % 积分系数
    Kd = 0;     % 微分系数
else
    % 位移反馈
    Kp = 27000;    % 比例系数
    Ki = 13000;     % 积分系数
    Kd = 00070;     % 微分系数
end

sim('MS_PID_Control_model.slx');