clear;clc
%% 系统参数
m1 = 1.6; % 电磁吸振器器质量
m2 = 100; % 待减振对象质量
k1 = 1600; % 电磁吸振器刚度
k2 = 100000; % 平台刚度
k_m = 45; % 电—力常数 N/A 来自要求文件
k_E = 30; % 作动器反电动势系数 % 来自图片参数
L = 0.0045; % 线圈的电感 来自图片参数
R_m = 5; % 线圈的电阻 % 来自图片参数
c1 = 0.2; % 电磁吸振器阻尼
c2 = 1; % 平台阻尼
is_a = true; % 是否加速度反馈
%% 状态空间方程建立
%% 有控制
A1 = [0 1 0 0;
    -k1/m1 -c1/m1 k1/m1 c1/m1;
    0 0 0 1;
    k1/m2 c1/m2 -(k1+k2)/m2 -(c1+c2)/m2];
B1 = [0 k_m/m2 0 -k_m/m2]';
C1 = [-k1/m1 -c1/m1 k1/m1 c1/m1;
    k1/m2 c1/m2 -(k1+k2)/m2 -(c1+c2)/m2];
D1 = 0;
E1 = [0 0 0 c2/m2;
    0 0 0 k2/m2]';
system1 = ss(A1,B1,C1,D1);
num1 = 1;
den1 = [L R_m];
G_system = tf(num1,den1);
%% 无控制
A2 = [0 1;
    -k2/m2 -c2/m2];
B2 = 0;
C2 = [1 0];
D2 = 0;
E2 = [0 0;
    c2/m2 k2/m2];
%% PID控制器
amp = 0.01; % 振幅
fre = 31.3;
% PID参数
if is_a
    % 加速度反馈
    Kp = 0; % 比例系数
    Ki = 1; % 积分系数
    Kd = 0.02; % 微分系数
else
    % 位移反馈
    Kp = 27000; % 比例系数
    Ki = 13000; % 积分系数
    Kd = 00070; % 微分系数
end
% sim('pid1111.slx');